app/views/users/show.html.erb

SELECT COUNT(*) FROM "dashboards" WHERE "dashboards"."user_id" = ?  [["user_id", 1]]
---
						<h4 class="list-group-item-heading"> Dashboards </h4>
						<p class="list-group-item-text"> <%= @user.dashboards.count %> </p>

UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "abcde"], ["updated_at", "2017-08-03 02:00:47.900329"], ["id", 25]]
---
						<h4 class="list-group-item-heading"> Last Updated </h4>
						<p class="list-group-item-text"> <%= @user.updated_at %> </p>