app/views/dashboards/index.html.erb

					<div class="panel-body">
						<% if @user.dashboards.empty? %>
---
SELECT  1 AS one FROM "dashboards" WHERE "dashboards"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT "dashboards".* FROM "dashboards" WHERE "dashboards"."user_id" = ?  [["user_id", 2]]

												<p> <em> <%= truncate d.description, length: 40 %> </em> </p>
												<p> <small> <%= "Reviews: #{d.reviews.count}" %> </small> </p>
---
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."dashboard_id" = ?  [["dashboard_id", 1]]