app/views/dashboards/show.html.erb

			<p> <%= "Updated at: <small> #{@dashboard.updated_at.to_formatted_s(:long)} </small>".html_safe %> </p>
			<p> <%= "Reviews: <small> #{@dashboard.reviews.count} </small>".html_safe %> </p>
---
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."dashboard_id" = ?  [["dashboard_id", 1]]