app/controllers/dashboards_controller.rb

	def index
		@dashboard = Dashboard.new
		@user = User.find_by(id: session["user_id"])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def create
		@user = User.find_by(id: session["user_id"])
		if @user.present?
			@dashboard = Dashboard.new
			@dashboard.name = params[:name]
			@dashboard.description = params[:description]
			@dashboard.user_id = session[:user_id]
			if @dashboard.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "dashboards" ("name", "description", "color", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "D1"], ["description", "example"], ["color", "rgb(221,232,249)"], ["user_id", 2], ["created_at", "2017-08-02 22:53:47.583499"], ["updated_at", "2017-08-02 22:53:47.583499"]]

	def show
		@dashboard = Dashboard.find_by(id: params[:id])
		@user = User.find_by(id: session["user_id"])
---
SELECT  "dashboards".* FROM "dashboards" WHERE "dashboards"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]