app/controllers/reviews_controller.rb

	def index
		if params["search"]
			#users can only manage their own reviews
    		@reviews = Review.where(user_id: session["user_id"]).search(params["search"]).order("updated_at DESC")
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = ? AND (name LIKE '%filter%' OR description LIKE '%filter%') ORDER BY updated_at DESC  [["user_id", 29]]

	def show
		@review = Review.find_by(id: params["id"])
		#users can only manage their own reviews
		if @review.present? && @review.user_id == session["user_id"]
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]

	def tag
		@review = Review.find_by(id: params["id"])
		if @review.present? && @review.user_id == session["user_id"]
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 109], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 28], ["LIMIT", 1]]

	def create
		@review = Review.new
		@review.name = params["name"]
		@review.description = params["description"]
		@review.user_id = session["user_id"]
		if @review.save
---
INSERT INTO "reviews" ("user_id", "created_at", "updated_at", "name", "description") VALUES (?, ?, ?, ?, ?)  [["user_id", 18], ["created_at", "2017-08-03 01:41:00.197089"], ["updated_at", "2017-08-03 01:41:00.197089"], ["name", "Another"], ["description", "abcdddeeed"]]

	def edit
		@review = Review.find_by(id: params["id"])
		#users can only manage their own reviews
		if @review.present? && @review.user_id == session["user_id"]
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 112], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 29], ["LIMIT", 1]]

	def update
		@review = Review.find_by(id: params["id"])
		if @review.present? && @review.user_id == session["user_id"]
    		@review.name = params["name"]
    		@review.description = params["description"]
    		if @review.save
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 113], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 29], ["LIMIT", 1]]
UPDATE "reviews" SET "description" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["description", "Test document."], ["updated_at", "2017-08-16 18:27:37.152499"], ["id", 110]]

	def destroy
		@review = Review.find_by(id: params["id"])
		#users can only manage their own reviews
		if @review.present? && @review.user_id == session["user_id"]
			@review.destroy
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 112], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 29], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 112]]