app/controllers/reviews_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
	def new
		@review = Review.new
		@user = User.find_by(id: session["user_id"])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
	def index
		@review = Review.new
		@user = User.find_by(id: session["user_id"])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
	def create
		@user = User.find_by(id: session["user_id"])