app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
	def create
		@user = User.new
		@user.email = params[:email]
		@user.name = params[:name]
		@user.password = params['password']
		if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "abcde"], ["updated_at", "2017-08-03 02:00:47.900329"], ["id", 25]]
---
	def update
		@user = User.find_by(id: params[:id])
		if session[:user_id].present? && @user.id == session["user_id"]
			@user.name = params[:name]
			if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def edit
		@user = User.find_by(id: params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
		@user = User.find_by(id: params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
---
	def destroy
		@user = User.find_by(id: params[:id])
		if @user.present? && @user.id == session["user_id"]
			reset_session
			@user.destroy