app/views/reviews/index.html.erb

SELECT  1 AS one FROM "reviews" WHERE "reviews"."user_id" = ? LIMIT ?  [["user_id", 3], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = ? AND (name LIKE '%filter%' OR description LIKE '%filter%') ORDER BY updated_at DESC  [["user_id", 29]]
---
				<div class="panel-body">
					<% if @user.reviews.empty? %>